# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\xavieran\Desktop\ECE3091\PSOCProjects\ENG3091_MandM\camera_test.cydsn\camera_test.cyprj
# Date: Wed, 14 Oct 2015 08:15:14 GMT
#set_units -time ns
create_clock -name {Camera_CLK(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {BEAM_Clock(routed)} -period 26318.18181818182 -waveform {0 13159.0909090909} [list [get_pins {ClockBlock/dclk_6}]]
create_clock -name {timer_clock(routed)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/dclk_7}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 15.151515151515152 -waveform {0 7.57575757575758} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {I2C_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 21} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {HC_CLOCK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 67 133} -nominal_period 1000 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {IR_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 661 1321} -nominal_period 10000 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Motor_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1651 3301} -nominal_period 25000 [list [get_pins {ClockBlock/dclk_glb_5}]]
create_clock -name {Motor_Clock(fixed-function)} -period 25000 -waveform {0 15.1515151515152} -nominal_period 25000 [get_pins {ClockBlock/dclk_glb_ff_5}]
create_generated_clock -name {BEAM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1737 3475} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 6601 13201} -nominal_period 100000 [list [get_pins {ClockBlock/dclk_glb_7}]]
create_generated_clock -name {Camera_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} -nominal_period 41.666666666666664 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {BUT_CLOCK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 11} -nominal_period 83.333333333333329 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {BUT_CLOCK(fixed-function)} -period 75.757575757575765 -waveform {0 15.1515151515152} -nominal_period 83.333333333333329 [get_pins {ClockBlock/dclk_glb_ff_1}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\xavieran\Desktop\ECE3091\PSOCProjects\ENG3091_MandM\camera_test.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\xavieran\Desktop\ECE3091\PSOCProjects\ENG3091_MandM\camera_test.cydsn\camera_test.cyprj
# Date: Wed, 14 Oct 2015 08:14:59 GMT
